'''Условие задачи "Факторизация":
Основная теорема арифметики говорит: любое число раскладывается на произведение простых множителей единственным образом,
с точностью до их перестановки. Например:

Число 8 можно представить как 2 * 2 * 2.
Число 50 – как 2 * 5 * 5 (или 5 * 5 * 2, или 5 * 2 * 5). Три варианта отличаются лишь порядком следования множителей.
Разложение числа на простые множители называется факторизацией числа.

Напишите программу, которая производит факторизацию переданного числа.
'''

'''Формат ввода:
В единственной строке дано число n, которое нужно факторизовать.
'''

'''Формат вывода:
Выведите в порядке неубывания простые множители, на которые раскладывается число n.
'''

# Пример ввода -> вывода:
inputs = [
    '8',    # -> 2 2 2
    '13',   # -> 13
    '100',  # -> 2 2 5 5
]

# тут ваше решение:


def factors(n):
    s = [2, 3, 4, 5, 6, 7, 8, 9]
    d = ''
    if n % 2 != 0:
        return n
    for i in s:
        while n % i == 0:
            n = n // i
            d = d + str(i) + " "
    return d


for i in inputs:
    print(factors(int(i)))